app/controllers/wishes_controller.rb

  def create
    @wish = Wish.new(wishes_params)
    @wish.save
---
INSERT INTO "wishes" ("link", "message", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)  [["link", "/ext-icon-6.png"], ["message", "asfasf"], ["created_at", 2016-10-09 09:48:42 UTC], ["updated_at", 2016-10-09 09:48:42 UTC], ["name", "asd"]]

  def index

    @wishes = Wish.paginate(:page => 1)
---
SELECT  "wishes".* FROM "wishes" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "wishes"

  def list
    params[:page] ||= 1
    @wishes = Wish.paginate(:page => params[:page]).order('updated_at DESC')
    pagecount = 1
    if @wishes.length == 0
---
SELECT  "wishes".* FROM "wishes" ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "wishes"
SELECT  "wishes".* FROM "wishes" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]